drlfoam/openfoam/test_cases/rotatingCylinder2D/Allrun
#!/bin/bash
cd "${0%/*}" || exit
. ${DRL_BASE:?}/openfoam/RunFunctions
#------------------------------------------------------------------------------

# run case
runParallel pimpleFoam

#------------------------------------------------------------------------------
