drlfoam/openfoam/test_cases/rotatingCylinder2D/Allrun.pre
#!/bin/bash
cd "${0%/*}" || exit
. ${DRL_BASE:?}/openfoam/RunFunctions
#------------------------------------------------------------------------------

# create mesh
runApplication blockMesh

# set inlet velocity
cp -r 0.org 0
runApplication setExprBoundaryFields

# decompose and run case
runApplication decomposePar
runParallel renumberMesh -overwrite
runParallel -s "pre" pimpleFoam

#------------------------------------------------------------------------------
