drlfoam/openfoam/test_cases/rotatingCylinder2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs ("${DRL_LIBBIN}/libAgentRotatingWallVelocity.so");

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         4.0;

deltaT          5.0e-4;

writeControl    runTime;

writeInterval   1.0;

purgeWrite      1;

writeFormat     ascii;

writePrecision  8;

timeFormat      general;

timePrecision   8;

runTimeModifiable false;

functions
{
    forces
    {
        type            forceCoeffs;
        libs            (forces);
        executeControl  timeStep;
        executeInterval 20;
        writeControl    timeStep;
        writeInterval   20;
        timeStart       4.0;
        log false;
        patches
        (
            cylinder
        );
        coefficients    (Cd Cl);
        rhoInf          1;
        rho             rhoInf;
        CofR            (0.2 0.2 0.005);
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        magUInf         1.0;
        lRef            0.1;
        Aref            0.001;
    }

    probes
    {
        type            probes;
        libs            (sampling);

        // Name of the directory for probe data
        name            probes;

        // Write at same frequency as fields
        executeControl  timeStep;
        executeInterval 20;
        writeControl    timeStep;
        writeInterval   20;
        timeStart       4.0;

        // Fields to be probed
        fields          (p);

        // Optional: do not recalculate cells if mesh moves
        fixedLocations  true;

        // Optional: interpolation scheme to use (default is cell)
        interpolationScheme cell;

        probeLocations
        (
            (0.3 0.15 0.005)
            (0.3 0.2 0.005)
            (0.3 0.25 0.005)
            (0.4 0.15 0.005)
            (0.4 0.2 0.005)
            (0.4 0.25 0.005)
            (0.5 0.15 0.005)
            (0.5 0.2 0.005)
            (0.5 0.25 0.005)
            (0.6 0.15 0.005)
            (0.6 0.2 0.005)
            (0.6 0.25 0.005)
        );

        // Optional: filter out points that haven't been found. Default
        //           is to include them (with value -VGREAT)
        includeOutOfBounds  false;
    }

}

// ************************************************************************* //
